from def_folder.data_normalization import append_value as ap, create_hyperlink
from def_folder import data_collection as coll

STATUS = {'Клеймо': 'Клеймо',
          'Нет элемента': 'Не найден элемент',
          'ДатаЗаключения': 'Дата заключения',
          'Материал': 'Материал',
          'Дата работ': 'Дата работ позже НК',
          'Совпало': 'Полное совпадение',
          'Заключение': 'Заключение',
          'Нет номера': 'Не найден номер',
          'Полное совпадение': 'Полное совпадение'}  # Итоговые статусы проверки


def reconciliation_data(jsr, csv):
    if not jsr:
        print('!!! Данны по ЖСР отсутствуют!')
        return None

    if not csv:
        print('!!! Данны по НК отсутствуют!')
        return None

    # Сопаставление данных КМД с АоРПИ
    for row_jsr in jsr:
        row_jsr['Совп.Номер'] = []
        row_jsr['Совп.Элемент'] = []
        for i, row_csv in enumerate(csv):
            if (str(row_jsr['Номер заключения']) == str(row_csv.get('Номер')) and
                    row_jsr['Тип'] == row_csv.get('ТипФайла|')):
                row_jsr['Совп.Номер'].append(i)
                if row_csv['НаимДетали'].lower() + ' ' in row_jsr['Свар.Элемент'].lower():
                    row_jsr['Совп.Элемент'].append(i)

    # Сверяем данные КМД с АоРПИ
    for row_jsr in jsr:
        row_jsr['Статус проверки'] = ''
        row_jsr['Расхождения'] = []
        if row_jsr['Совп.Номер']:
            if row_jsr['Совп.Элемент']:
                row_csv = csv[row_jsr['Совп.Элемент'][0]]  # Строка в таблице АоРПИ
                row_jsr['Номер заключения'] = create_hyperlink(row_csv["ПутьФайла|"], row_csv['Файл'], row_jsr['Номер заключения'])

                # НаимДетали
                row_jsr['Расхождения'].append({'Тип': 'Свар.Элемент',
                                               'Рез':  row_jsr['Свар.Элемент'],
                                               'Преф': 'Данные из ЖСР: \n'})
                row_jsr['Свар.Элемент'] = row_csv['НаимДетали']

                # Клеймо
                if row_jsr['Клеймо'] != row_csv['Клеймо']:
                    row_jsr['Статус проверки'] = ap(row_jsr['Статус проверки'], STATUS['Клеймо'])
                    row_jsr['Расхождения'].append({'Тип': 'Клеймо',
                                                   'Рез': row_csv['Клеймо'],
                                                   'Преф': 'Клеймо из НК: \n'})

                # Результат заключения
                if row_jsr['Результат заключения'] != row_csv['Заключение']:
                    row_jsr['Статус проверки'] = ap(row_jsr['Статус проверки'], STATUS['Заключение'])
                    row_jsr['Расхождения'].append({'Тип': 'Результат заключения',
                                                   'Рез': row_csv['Заключение'],
                                                   'Преф': 'Заключение из НК: \n'})

                # Дата заключения
                if row_jsr['Дата заключения'] != row_csv['Дата']:
                    row_jsr['Статус проверки'] = ap(row_jsr['Статус проверки'], STATUS['ДатаЗаключения'])
                    row_jsr['Расхождения'].append({'Тип': 'Дата заключения',
                                                   'Рез': row_csv['Дата'],
                                                   'Преф': 'Дата из НК: \n'})

                # Дата работ
                if coll.checks_dates(row_jsr.setdefault('Дата работ', ''),
                                       row_csv.setdefault('Дата',''), '>'):
                    row_jsr['Статус проверки'] = ap(row_jsr['Статус проверки'], STATUS['Дата работ'])
                    row_jsr['Расхождения'].append({'Тип': 'Дата работ',
                                                   'Рез': row_csv['Дата'],
                                                   'Преф': 'Дата из НК: \n'})

                # Материал
                if not row_csv['Материал'] in row_jsr['Наим/Сталь']:
                    row_jsr['Статус проверки'] = ap(row_jsr['Статус проверки'], STATUS['Материал'])
                    row_jsr['Расхождения'].append({'Тип': 'Наим/Сталь',
                                                   'Рез': row_csv['Материал'],
                                                   'Преф': 'Материал из НК: \n'})
                else:
                    row_jsr['Наим/Сталь'] = row_csv['Материал']
            else:
                row_jsr['Статус проверки'] = STATUS['Нет элемента']
        else:
            row_jsr['Статус проверки'] = STATUS['Нет номера']
        if row_jsr['Статус проверки'] == '':
            row_jsr['Статус проверки'] = STATUS['Полное совпадение']

    print('Сверка CSV(Заключений) с ЖСР произведена.')
    return jsr
